Correções do Motor de scoring
